In [1]:
import pandas as pd

In [2]:
df_india_weather = pd.DataFrame({
    "city":["Mumbai","Delhi","Hyderabad","Chennai"],
    "temperature":[32.5,37,30,25],
    "aqi":[300,450,270,150]
})
df_india_weather

        city  temperature  aqi
0     Mumbai         32.5  300
1      Delhi         37.0  450
2  Hyderabad         30.0  270
3    Chennai         25.0  150

In [3]:
df_us_weather = pd.DataFrame({
    "city":["New York","Chicago","Orlando"],
    "temperature":[28,25,16],
    "aqi":[10,15,7]
})
df_us_weather

       city  temperature  aqi
0  New York           28   10
1   Chicago           25   15
2   Orlando           16    7

In [4]:
df_weather = pd.concat([df_india_weather,df_us_weather])

df_weather

        city  temperature  aqi
0     Mumbai         32.5  300
1      Delhi         37.0  450
2  Hyderabad         30.0  270
3    Chennai         25.0  150
0   New York         28.0   10
1    Chicago         25.0   15
2    Orlando         16.0    7

In [13]:
df_weather = pd.concat([df_india_weather,df_us_weather], ignore_index=True)

df_weather

        city  temperature  aqi
0     Mumbai         32.5  300
1      Delhi         37.0  450
2  Hyderabad         30.0  270
3    Chennai         25.0  150
4   New York         28.0   10
5    Chicago         25.0   15
6    Orlando         16.0    7

In [14]:
df_weather = pd.concat([df_india_weather,df_us_weather], keys=["India","USA"])

df_weather

              city  temperature  aqi
India 0     Mumbai         32.5  300
      1      Delhi         37.0  450
      2  Hyderabad         30.0  270
      3    Chennai         25.0  150
USA   0   New York         28.0   10
      1    Chicago         25.0   15
      2    Orlando         16.0    7

In [20]:
df_weather = pd.concat([df_india_weather,df_us_weather],keys=["India","USA"])

df_weather

              city  temperature  aqi
India 0     Mumbai         32.5  300
      1      Delhi         37.0  450
      2  Hyderabad         30.0  270
      3    Chennai         25.0  150
USA   0   New York         28.0   10
      1    Chicago         25.0   15
      2    Orlando         16.0    7

In [21]:
df_weather

              city  temperature  aqi
India 0     Mumbai         32.5  300
      1      Delhi         37.0  450
      2  Hyderabad         30.0  270
      3    Chennai         25.0  150
USA   0   New York         28.0   10
      1    Chicago         25.0   15
      2    Orlando         16.0    7

In [22]:
df_weather.loc["India"]

        city  temperature  aqi
0     Mumbai         32.5  300
1      Delhi         37.0  450
2  Hyderabad         30.0  270
3    Chennai         25.0  150

In [23]:
df_weather.index

MultiIndex([('India', 0),
            ('India', 1),
            ('India', 2),
            ('India', 3),
            (  'USA', 0),
            (  'USA', 1),
            (  'USA', 2)],
           )

In [24]:
df_india_weather

        city  temperature  aqi
0     Mumbai         32.5  300
1      Delhi         37.0  450
2  Hyderabad         30.0  270
3    Chennai         25.0  150

In [26]:
df_india_weather.set_index("city", inplace=True)

In [27]:
df_india_weather

           temperature  aqi
city
Mumbai            32.5  300
Delhi             37.0  450
Hyderabad         30.0  270
Chennai           25.0  150

In [30]:
df_us_weather.set_index("city",inplace=True)
df_us_weather

          temperature  aqi
city
New York           28   10
Chicago            25   15
Orlando            16    7

In [31]:
df_us_weather

          temperature  aqi
city
New York           28   10
Chicago            25   15
Orlando            16    7

In [32]:
pd.concat([df_india_weather, df_us_weather])

           temperature  aqi
city
Mumbai            32.5  300
Delhi             37.0  450
Hyderabad         30.0  270
Chennai           25.0  150
New York          28.0   10
Chicago           25.0   15
Orlando           16.0    7

In [36]:
df_weather = pd.concat([df_india_weather, df_us_weather], keys=["India","USA"])
df_weather

                 temperature  aqi
      city
India Mumbai            32.5  300
      Delhi             37.0  450
      Hyderabad         30.0  270
      Chennai           25.0  150
USA   New York          28.0   10
      Chicago           25.0   15
      Orlando           16.0    7

In [37]:
df_weather

                 temperature  aqi
      city
India Mumbai            32.5  300
      Delhi             37.0  450
      Hyderabad         30.0  270
      Chennai           25.0  150
USA   New York          28.0   10
      Chicago           25.0   15
      Orlando           16.0    7

In [38]:
df_weather.index

MultiIndex([('India',    'Mumbai'),
            ('India',     'Delhi'),
            ('India', 'Hyderabad'),
            ('India',   'Chennai'),
            (  'USA',  'New York'),
            (  'USA',   'Chicago'),
            (  'USA',   'Orlando')],
           names=[None, 'city'])

In [39]:
df_weather.loc["India"]

           temperature  aqi
city
Mumbai            32.5  300
Delhi             37.0  450
Hyderabad         30.0  270
Chennai           25.0  150

In [40]:
df_weather.reset_index()

  level_0       city  temperature  aqi
0   India     Mumbai         32.5  300
1   India      Delhi         37.0  450
2   India  Hyderabad         30.0  270
3   India    Chennai         25.0  150
4     USA   New York         28.0   10
5     USA    Chicago         25.0   15
6     USA    Orlando         16.0    7

In [42]:
df_weather.reset_index().index

RangeIndex(start=0, stop=7, step=1)

In [46]:
pd.DataFrame({
    "Name":["Rohit","Rohan","Pranjal","Shruti"],
    "age":[60,5,12,15],
    "gender":["Male","Male","Female","Female"]
},index=[1,2,3,4])

      Name  age  gender
1    Rohit   60    Male
2    Rohan    5    Male
3  Pranjal   12  Female
4   Shruti   15  Female

In [47]:
pd.DataFrame({
    "Name":["Rohit","Rohan","Pranjal","Shruti"],
    "age":[60,5,12,15],
    "gender":["Male","Male","Female","Female"]
},index=range(1,5))

      Name  age  gender
1    Rohit   60    Male
2    Rohan    5    Male
3  Pranjal   12  Female
4   Shruti   15  Female

In [48]:
pd.DataFrame({
    "Name":["Rohit","Rohan","Pranjal","Shruti"],
    "age":[60,5,12,15],
    "gender":["Male","Male","Female","Female"]
},index=range(10,50,10))

       Name  age  gender
10    Rohit   60    Male
20    Rohan    5    Male
30  Pranjal   12  Female
40   Shruti   15  Female

In [52]:
pd.DataFrame({
    "Name":["Rohit","Rohan","Pranjal","Shruti"],
    "age":[60,5,12,15],
    "gender":["Male","Male","Female","Female"]
},index=range(0,100,30))

       Name  age  gender
0     Rohit   60    Male
30    Rohan    5    Male
60  Pranjal   12  Female
90   Shruti   15  Female

In [54]:
df = pd.DataFrame({
    "Name":["Rohit","Rohan","Pranjal","Shruti"],
    "age":[60,5,12,15],
    "gender":["Male","Male","Female","Female"]
},index=range(4,0,-1))

In [56]:
df

      Name  age  gender
4    Rohit   60    Male
3    Rohan    5    Male
2  Pranjal   12  Female
1   Shruti   15  Female

In [63]:
df.iloc[0]

Name      Rohit
age          60
gender     Male
Name: 4, dtype: object

In [64]:
df.iloc[-1]

Name      Shruti
age           15
gender    Female
Name: 1, dtype: object

In [60]:
df.loc[1]

Name      Shruti
age           15
gender    Female
Name: 1, dtype: object

In [61]:
df.loc[4]

Name      Rohit
age          60
gender     Male
Name: 4, dtype: object